khose-ie/smac-stm32/source/smac-stm32-canfd.c
/// @brief Asynchronously transmit a CAN FD message using the specified CAN FD instance.
/// @details The specific implementation of @ref smac_can_fd_async_transmit for CAN FD.
smacRetCode_t smac_can_fd_async_transmit(smacCanFd_t canfd, const smacCanFdMessage* message)
{
    FDCAN_TxHeaderTypeDef head;
    stm32Device_t* device = (stm32Device_t*)canfd;

    if ((device == NULL) || (device->handle == NULL) || (message == NULL))
    {
        return SMAC_RET_PARAM_ERR;
    }

    memset(&head, 0, sizeof(head));

    head.Identifier          = message->head.ident;
    head.IdType              = cast_to_stm32_id_type(message->head.frame_kind);
    head.TxFrameType         = cast_to_stm32_frame_type(message->head.request_kind);
    head.DataLength          = message->head.data_length;
    head.ErrorStateIndicator = cast_to_stm32_error_state(message->head.error_state);
    head.BitRateSwitch       = cast_to_stm32_bit_rate_switch(message->head.switch_bit_rate);
    head.FDFormat            = cast_to_stm32_format(message->head.format);
    head.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
    head.MessageMarker       = 0;

    return stm32_cast_code(HAL_FDCAN_AddMessageToTxFifoQ(device->handle, &head, message->data));
}

/// @brief Asynchronously receive a CAN FD message from the specified channel using the specified
/// CAN FD instance.
/// @param canfd The CAN FD instance.
/// @param channel The channel from which to receive the message.
/// @param message Pointer to the structure to store the received message.
/// @return @ref SMAC_RET_OK if the message is successfully queued for asynchronous reception,
/// otherwise an error code.
static smacRetCode_t smac_can_fd_async_receive(smacCanFd_t canfd, uint32_t channel,
                                               smacCanFdMessage* message)
{
    stm32Device_t* device = (stm32Device_t*)canfd;

    if ((device == NULL) || (device->handle == NULL) || (message == NULL))
    {
        return SMAC_RET_PARAM_ERR;
    }

    memset(message, 0, sizeof(*message));

    if (stm32_device_cache_queue_allocate(device) != SMAC_RET_OK)
    {
        return SMAC_RET_STACK_OVERFLOW;
    }

    return stm32_device_cache_queue_set_cache(device, channel, (stm32DeviceCacheData_t)message);
}

/// @brief Asynchronously receive a CAN FD message from channel 0 using the specified CAN FD
/// instance.
/// @details This function is a convenience wrapper around @ref smac_can_fd_async_receive,
/// specifically for channel 0.
smacRetCode_t smac_can_fd_async_receive_channel0(smacCanFd_t canfd, smacCanFdMessage* message)
{
    return smac_can_fd_async_receive(canfd, 0, message);
}

/// @brief Asynchronously receive a CAN FD message from channel 1 using the specified CAN FD
/// instance.
/// @details This function is a convenience wrapper around @ref smac_can_fd_async_receive,
/// specifically for channel 1.
smacRetCode_t smac_can_fd_async_receive_channel1(smacCanFd_t canfd, smacCanFdMessage* message)
{
    return smac_can_fd_async_receive(canfd, 1, message);
}

/// ===============================================================================================
/// @defgroup can_fd_classic_interface CAN FD Classic Interface
/// @brief Interface for handling CAN FD events in a classic manner.
/// ===============================================================================================

/// @brief Create a classic CAN instance.
/// @details The specific implementation of @ref smac_can_fd_create_classic.
smacCanFd_t smac_can_fd_create_classic(void* handle)
{
    // Allocate a device from the STM32 device queue for the classic CAN instance.
    stm32Device_t* device = stm32_device_queue_allocate(handle, CAN_FD_ROLE_CLASSIC);

    if (device == NULL)
    {
        return NULL;
    }
    // Initialize the cache for this device in the STM32 device cache queue.
    if (stm32_device_cache_queue_allocate(device) != SMAC_RET_OK)
    {
        stm32_device_queue_free(device);
        return NULL;
    }

    return (smacCanFd_t)device;
}

/// @brief Set the CAN FD event handling mode to classic for the specified CAN FD instance.
/// @details This function configures the CAN FD instance to use the classic event handling mode,
/// where events are handled using the traditional CAN event callbacks.
smacRetCode_t smac_can_fd_set_event_classic(smacCanFd_t canfd, smacCanEvent_t* event,
                                            smacMcuEventData_t data)
{
    return stm32_device_event_queue_allocate((stm32Device_t*)canfd,
                                             (stm32DeviceEventHandle_t*)event, data);
}

/// @brief Transmit a CAN FD message using the classic event handling mode.
/// @details This function transmits a CAN FD message using the classic event handling mode,
/// where the message is sent using the traditional CAN FD transmit function.
smacRetCode_t smac_can_fd_transmit_classic(smacCanFd_t canfd, const smacCanMessage* message,
                                           uint32_t timeout)
{
    smacCanFdMessage can_fd_message;

    can_fd_message.head.ident           = message->head.ident;
    can_fd_message.head.frame_kind      = message->head.frame_kind;
    can_fd_message.head.request_kind    = message->head.request_kind;
    can_fd_message.head.data_length     = message->head.data_length;
    can_fd_message.head.format          = SMAC_CAN_CLASSIC;
    can_fd_message.head.error_state     = SMAC_CAN_ERROR_ACTIVE;
    can_fd_message.head.switch_bit_rate = false;

    smac_can_fd_message_set_data(&can_fd_message, message->data);

    return smac_can_fd_transmit(canfd, &can_fd_message, timeout);
}

/// @brief Receive a CAN FD message from channel 0 using the classic event handling mode.
/// @details This function receives a CAN FD message from channel 0 using the classic event handling
/// mode, where the message is received using the traditional CAN FD receive function.
smacRetCode_t smac_can_fd_receive_channel0_classic(smacCanFd_t canfd, smacCanMessage* message,
                                                   uint32_t timeout)
{
    smacCanFdMessage can_fd_message;

    smacRetCode_t code = smac_can_fd_receive_channel0(canfd, &can_fd_message, timeout);

    if (code == SMAC_RET_OK)
    {
        message->head.ident        = can_fd_message.head.ident;
        message->head.frame_kind   = can_fd_message.head.frame_kind;
        message->head.request_kind = can_fd_message.head.request_kind;
        message->head.data_length  = can_fd_message.head.data_length;

        smac_can_message_set_data(message, can_fd_message.data);
    }

    return code;
}

/// @brief Receive a CAN FD message from channel 1 using the classic event handling mode.
/// @details This function receives a CAN FD message from channel 1 using the classic event handling
/// mode, where the message is received using the traditional CAN FD receive function.
smacRetCode_t smac_can_fd_receive_channel1_classic(smacCanFd_t canfd, smacCanMessage* message,
                                                   uint32_t timeout)
{
    smacCanFdMessage can_fd_message;

    smacRetCode_t code = smac_can_fd_receive_channel1(canfd, &can_fd_message, timeout);

    if (code == SMAC_RET_OK)
    {
        message->head.ident        = can_fd_message.head.ident;
        message->head.frame_kind   = can_fd_message.head.frame_kind;
        message->head.request_kind = can_fd_message.head.request_kind;
        message->head.data_length  = can_fd_message.head.data_length;

        smac_can_message_set_data(message, can_fd_message.data);
    }

    return code;
}

