khose-ie/smac-stm32/source/smac-stm32-canfd.c
/// @brief Asynchronously transmit a CAN FD message using the classic event handling mode.
/// @details This function initiates the asynchronous transmission of a CAN FD message using the
/// classic event handling mode, where the message is sent using the traditional CAN FD asynchronous
/// transmit function.
smacRetCode_t smac_can_fd_async_transmit_classic(smacCanFd_t canfd, const smacCanMessage* message)
{
    smacCanFdMessage can_fd_message;

    can_fd_message.head.ident           = message->head.ident;
    can_fd_message.head.frame_kind      = message->head.frame_kind;
    can_fd_message.head.request_kind    = message->head.request_kind;
    can_fd_message.head.data_length     = message->head.data_length;
    can_fd_message.head.format          = SMAC_CAN_CLASSIC;
    can_fd_message.head.error_state     = SMAC_CAN_ERROR_ACTIVE;
    can_fd_message.head.switch_bit_rate = false;

    smac_can_fd_message_set_data(&can_fd_message, message->data);

    return smac_can_fd_async_transmit(canfd, &can_fd_message);
}

/// @brief Asynchronously receive a CAN FD message from the specified channel using the classic
/// event handling mode.
/// @details This function initiates the asynchronous reception of a CAN FD message from the
/// specified channel using the classic event handling mode, where the message is received using the
/// traditional CAN FD asynchronous receive function.
static smacRetCode_t smac_can_fd_async_receive_classic(smacCanFd_t canfd, uint32_t channel,
                                                       smacCanMessage* message)
{
    stm32Device_t* device = (stm32Device_t*)canfd;

    if ((device == NULL) || (device->handle == NULL) || (message == NULL))
    {
        return SMAC_RET_PARAM_ERR;
    }

    memset(message, 0, sizeof(*message));

    if (stm32_device_cache_queue_allocate(device) != SMAC_RET_OK)
    {
        return SMAC_RET_STACK_OVERFLOW;
    }

    return stm32_device_cache_queue_set_cache(device, channel, (stm32DeviceCacheData_t)message);
}

/// @brief Asynchronously receive a CAN FD message from channel 0 using the classic event handling
/// mode.
/// @details This function initiates the asynchronous reception of a CAN FD message from channel 0
/// using the classic event handling mode, where the message is received using the traditional CAN
/// FD asynchronous receive function.
smacRetCode_t smac_can_fd_async_receive_channel0_classic(smacCanFd_t canfd, smacCanMessage* message)
{
    return smac_can_fd_async_receive_classic(canfd, 0, message);
}

/// @brief Asynchronously receive a CAN FD message from channel 1 using the classic event handling
/// mode.
/// @details This function initiates the asynchronous reception of a CAN FD message from channel 1
/// using the classic event handling mode, where the message is received using the traditional CAN
/// FD asynchronous receive function.
smacRetCode_t smac_can_fd_async_receive_channel1_classic(smacCanFd_t canfd, smacCanMessage* message)
{
    return smac_can_fd_async_receive_classic(canfd, 1, message);
}

/// ===============================================================================================
/// @name CAN classic interface
/// @brief Implementation of classic CAN interface functions for handling various CAN events with
/// CAN FD device.
/// ===============================================================================================

/// @brief Create a CAN instance within the MCU abstraction layer.
/// @details Implement the creation API of smac mcu, please see @ref smac_can_create for details.
smacCan_t smac_can_create(void* handle)
{
    return smac_can_fd_create_classic(handle);
}

/// @brief Drop a CAN instance within the MCU abstraction layer.
/// @details Implement the dropping API of smac mcu, please see @ref smac_can_drop for details.
void smac_can_drop(smacCan_t can)
{
    smac_can_fd_drop(can);
}

/// @brief Implement the setting of CAN event callbacks for the specified CAN instance within the
/// MCU abstraction layer.
/// @details Implement the setting API of smac mcu, please see @ref smac_can_set_event for details.
smacRetCode_t smac_can_set_event(smacCan_t can, smacCanEvent_t* event, smacMcuEventData_t data)
{
    return smac_can_fd_set_event_classic(can, event, data);
}

/// @brief Clean CAN event callbacks for the specified CAN instance.
/// @details Implement the cleaning API of smac mcu, please see @ref smac_can_clean_event for
/// details.
void smac_can_clean_event(smacCan_t can)
{
    smac_can_fd_clean_event(can);
}

/// @brief Activate a CAN instance within the MCU abstraction layer.
/// @details Implement the activation API of smac mcu, please see @ref smac_can_active for details.
smacRetCode_t smac_can_active(smacCan_t can)
{
    return smac_can_fd_active(can);
}

/// @brief Deactivate a CAN instance within the MCU abstraction layer.
/// @details Implement the deactivation API of smac mcu, please see @ref smac_can_deactive for
/// details.
smacRetCode_t smac_can_deactive(smacCan_t can)
{

    return smac_can_fd_deactive(can);
}

/// @brief Transmit a message over the specified CAN instance.
/// @details Implement the transmission API of smac mcu, please see @ref smac_can_transmit for
/// details.
smacRetCode_t smac_can_transmit(smacCan_t can, const smacCanMessage* message, uint32_t timeout)
{
    return smac_can_fd_transmit_classic(can, message, timeout);
}

/// @brief Receive a message from channel 0 of the specified CAN instance.
/// @details Implement the reception API of smac mcu for channel 0, please see @ref
/// smac_can_receive_channel0 for details.
smacRetCode_t smac_can_receive_channel0(smacCan_t can, smacCanMessage* message, uint32_t timeout)
{
    return smac_can_fd_receive_channel0_classic(can, message, timeout);
}
/// @brief Receive a message from channel 1 of the specified CAN instance.
/// @details Implement the reception API of smac mcu for channel 1, please see @ref
/// smac_can_receive_channel1 for details.
smacRetCode_t smac_can_receive_channel1(smacCan_t can, smacCanMessage* message, uint32_t timeout)
{
    return smac_can_fd_receive_channel1_classic(can, message, timeout);
}

/// @brief Asynchronously transmit a message over the specified CAN instance.
/// @details Implement the asynchronous transmission API of smac mcu, please see @ref
/// smac_can_async_transmit for details.
smacRetCode_t smac_can_async_transmit(smacCan_t can, const smacCanMessage* message)
{

    return smac_can_fd_async_transmit_classic(can, message);
}

/// @brief Asynchronously receive a message over channel 0 of the specified CAN instance.
/// @details Implement the asynchronous reception API of smac mcu for channel 0, please see @ref
/// smac_can_async_receive_channel0 for details.
smacRetCode_t smac_can_async_receive_channel0(smacCan_t can, smacCanMessage* message)
{

