khose-ie/smac-stm32/source/smac-stm32-canfd.c
    return smac_can_fd_async_receive_channel0_classic(can, message);
}

/// @brief Asynchronously receive a message over channel 1 of the specified CAN instance.
/// @details Implement the asynchronous reception API of smac mcu for channel 1, please see @ref
/// smac_can_async_receive_channel1 for details.
smacRetCode_t smac_can_async_receive_channel1(smacCan_t can, smacCanMessage* message)
{
    return smac_can_fd_async_receive_channel1_classic(can, message);
}

/// ===============================================================================================
/// @name CAN FD Callback Implementations
/// @brief Implementation of CAN FD callback functions for handling various CAN FD events.
/// ===============================================================================================

/// @brief Handle the reception of a CAN FD message from the specified FIFO.
/// @param hfdcan Pointer to the FDCAN handle.
/// @param RxFifoITs Interrupt status flags for the RX FIFO.
/// @param fifo The FIFO number from which the message is received.
static void on_rx_fifo_callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifoITs, uint32_t fifo)
{
    (void)RxFifoITs;

    stm32DeviceCache_t* cache = stm32_device_cache_queue_search((stm32DeviceHandle_t)hfdcan);

    if ((cache == NULL) || (cache->cache_data[fifo] == (uintptr_t)NULL))
    {
        return;
    }

    if (smac_can_fd_receive(cache->device, fifo, (smacCanFdMessage*)cache->cache_data[fifo], 0) !=
        SMAC_RET_OK)
    {
        return;
    }

    stm32DeviceEvent_t* event = stm32_device_event_queue_search((stm32DeviceHandle_t)hfdcan);

    if ((event->device->addition & CAN_FD_ROLE_MASK) == CAN_FD_ROLE_FD)
    {
        if ((event != NULL) && (event->event != NULL) && (event->event->can_fd.rx_complete != NULL))
        {
            event->event->can_fd.rx_complete(event->device, event->event_data);
        }
    }
    else if ((event->device->addition & CAN_FD_ROLE_MASK) == CAN_FD_ROLE_CLASSIC)
    {
        if ((event != NULL) && (event->event != NULL) && (event->event->can.rx_complete != NULL))
        {
            event->event->can.rx_complete(event->device, event->event_data);
        }
    }
}

// void HAL_FDCAN_TxEventFifoCallback(FDCAN_HandleTypeDef* hfdcan, uint32_t TxEventFifoITs);

void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifo0ITs)
{
    on_rx_fifo_callback(hfdcan, RxFifo0ITs, 0);
}

void HAL_FDCAN_RxFifo1Callback(FDCAN_HandleTypeDef* hfdcan, uint32_t RxFifo1ITs)
{
    on_rx_fifo_callback(hfdcan, RxFifo1ITs, 1);
}

// void HAL_FDCAN_TxFifoEmptyCallback(FDCAN_HandleTypeDef* hfdcan);

void HAL_FDCAN_TxBufferCompleteCallback(FDCAN_HandleTypeDef* hfdcan, uint32_t BufferIndexes)
{
    (void)BufferIndexes;

    stm32DeviceEvent_t* event = stm32_device_event_queue_search((stm32DeviceHandle_t)hfdcan);

    if ((event->device->addition & CAN_FD_ROLE_MASK) == CAN_FD_ROLE_FD)
    {
        if ((event != NULL) && (event->event != NULL) && (event->event->can_fd.tx_complete != NULL))
        {
            event->event->can_fd.tx_complete(event->device, event->event_data);
        }
    }
    else if ((event->device->addition & CAN_FD_ROLE_MASK) == CAN_FD_ROLE_CLASSIC)
    {
        if ((event != NULL) && (event->event != NULL) && (event->event->can.tx_complete != NULL))
        {
            event->event->can.tx_complete(event->device, event->event_data);
        }
    }
}

// void HAL_FDCAN_TxBufferAbortCallback(FDCAN_HandleTypeDef* hfdcan, uint32_t BufferIndexes);
// void HAL_FDCAN_HighPriorityMessageCallback(FDCAN_HandleTypeDef* hfdcan);
// void HAL_FDCAN_TimestampWraparoundCallback(FDCAN_HandleTypeDef* hfdcan);
// void HAL_FDCAN_TimeoutOccurredCallback(FDCAN_HandleTypeDef* hfdcan);
// void HAL_FDCAN_ErrorCallback(FDCAN_HandleTypeDef* hfdcan);
// void HAL_FDCAN_ErrorStatusCallback(FDCAN_HandleTypeDef* hfdcan, uint32_t ErrorStatusITs);

#endif // HAL_FDCAN_MODULE_ENABLED
